Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ДобавитьТест("ТестНТТРСервиса").ВТранзакции(Истина);

КонецПроцедуры 

Процедура ТестНТТРСервиса() Экспорт

// - Создание Справочник.Товары
ТоварСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.Товары")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Родитель", Справочники.Товары.НайтиПоНаименованию("Обувь",Истина))
	.Установить("Код", "00045323")  
	.Установить("Наименование", НСтр("ru = 'Валенки3333'"))
	.Установить("Артикул", НСтр("ru = 'ОБ-00100'")) 
	.Установить("Поставщик", Справочники.Контрагенты.НайтиПоНаименованию("Пантера АО", Истина)) 
	.Установить("ФайлКартинки", Справочники.ХранимыеФайлы.НайтиПоНаименованию("Валенки", Истина)) 
	.Установить("Вид", Перечисления.ВидыТоваров.Товар)  // Еще варианты: Услуга
	.Установить("Описание", НСтр("ru = '<!DOCTYPE html><html dir=""ltr""><head><meta name=""viewport"" content=""initial-scale=1.0, width=device-width""></meta><meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""></meta><meta http-equiv=""X-UA-Compatible"" content=""IE=Edge""></meta><meta name=""format-detection"" content=""telephone=no""></meta><style type=""text/css"">
|body{margin:0;padding:8px;}
|p{line-height:1.15;margin:0;white-space:pre-wrap;}
|ol,ul{margin-top:0;margin-bottom:0;}
|img{border:none;}
|li>p{display:inline;}
|</style></head><body>
|<p>Валенки классические серые в ассортименте: с искусственным мехом по верху голенища, с рисунками на голенище (месяц, солнце, радуга, медведь, и т.д.).</p>
|<p><br></p>
|<p><span style=""font-weight: bold;"">Состав -</span><span style=""font-weight: bold;""> </span>100 % войлок.</p>
|<p><span style=""font-weight: bold;"">Страна</span><span style=""font-weight: bold;"">-</span><span style=""font-weight: bold;"">производитель -</span><span style=""font-weight: bold;""> </span>Россия.</p>
|</body></html>'"))
	.Записать()
	;

Запрос = ЮТест.Данные().HttpСервисЗапрос();


Запрос.Метод("GET")
.БазовыйURL("http://localhost/Demo")
.ОтносительныйURL("/hs/Products/")
.ДобавитьЗаголовок("Content-Type", "application/json")
.ДобавитьПараметрURL("*", ТоварСсылка.Код);

Ответ = СервисТовары.ПутьКТоваруGETПереопределение(Запрос);

Ютест.ОжидаетЧто(Ответ.КодСостояния).Равно(200);

ОбъектСтрока= Ответ.ПолучитьТелоКакСтроку();
	
ЧтениеXML = Новый ЧтениеXMl;
ЧтениеXML.УстановитьСтроку(ОбъектСтрока);
ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
ЧтениеXML.Закрыть(); 

ЮТест.ОжидаетЧто(ОбъектXDTO).ИмеетТип(Тип("ОбъектXDTO"));
ЮТест.ОжидаетЧто(ОбъектXDTO.CatalogObject_Товары.Code).Равно(ТоварСсылка.Код);
ЮТест.ОжидаетЧто(ОбъектXDTO.CatalogObject_Товары.Описание).Равно(ТоварСсылка.Описание);


КонецПроцедуры
 
