  Процедура ОформлениеПродажи() Экспорт
  

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаказ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК ДокЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходТовара КАК РасходТовара
		|		ПО (РасходТовара.Заказ = ДокЗаказ.Ссылка)
		|ГДЕ
		|	ДокЗаказ.Онлайн
		|	И РасходТовара.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяПродажа = Документы.РасходТовара.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НоваяПродажа,ВыборкаДетальныеЗаписи.Ссылка);
		Для каждого СтрокаТовары Из ВыборкаДетальныеЗаписи.Ссылка.Товары Цикл
			
			НоваяСтрока = НоваяПродажа.Товары.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары);
			
		
		КонецЦикла; 
		
		НоваяПродажа.Заказ = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяПродажа.Дата = ТекущаяДатаСеанса();
		НоваяПродажа.УстановитьНовыйНомер();
		НоваяПродажа.Записать(РежимЗаписиДокумента.Проведение);
		
		
	КонецЦикла;
		
  
  КонецПроцедуры
  
  
  
	
		
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
