Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ДобавитьТест("ПроверитьОнлайнПродажи").ВТранзакции(Истина);

КонецПроцедуры 

Процедура ПроверитьОнлайнПродажи() Экспорт


// - Создание Документ.ПриходТовара
ПоступлениеТовараСсылка = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Поставщик", Справочники.Контрагенты.НайтиПоНаименованию("ЭлектроБыт ЗАО", Истина)) 
	.Установить("Склад", Справочники.Склады.НайтиПоНаименованию("Малый", Истина)) 
	.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина)) 
	.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Все для дома""", Истина))
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Veko67NE", Истина)) 
				.Установить("Цена", 7000) 
				.Установить("Количество", 15) 
				.Установить("Сумма", 105000)
	.Провести() // Проводим документ и возвращаем ссылку
	;


// - Создание Документ.ПриходТовара
ПоступлениеТовараСсылка = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Поставщик", Справочники.Контрагенты.НайтиПоНаименованию("ЭлектроБыт ЗАО", Истина)) 
	.Установить("Склад", Справочники.Склады.НайтиПоНаименованию("Большой", Истина)) 
	.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина)) 
	.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""Все для дома""", Истина))
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Sony К3456P", Истина)) 
				.Установить("Цена", 4500) 
				.Установить("Количество", 7) 
				.Установить("Сумма", 31500)
	.Провести() // Проводим документ и возвращаем ссылку
	;


// - Создание Документ.Заказ

Ссылка1 = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", Справочники.Контрагенты.НайтиПоНаименованию("Новый контрагент", Истина)) 
	.Установить("Склад", Справочники.Склады.НайтиПоНаименованию("Строящийся склад", Истина)) 
	.Установить("ВидЦен", Справочники.ВидыЦен.Закупочная) 
	.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина)) 
	.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""1000 мелочей""", Истина)) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  // Еще варианты: ВРаботе, Выполнен, Закрыт
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Admin", Истина)) 
	.Установить("Сумма", 2222) 
	.Установить("Онлайн", Истина)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Veko67NE", Истина)) 
				.Установить("Цена", 50000) 
				.Установить("Количество", 1) 
				.Установить("Сумма", 50000)
	.Провести() // Проводим документ и возвращаем ссылку
	;



// - Создание Документ.Заказ
Ссылка2 = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", Справочники.Контрагенты.НайтиПоНаименованию("Новый контрагент", Истина)) 
	.Установить("Склад", Справочники.Склады.НайтиПоНаименованию("Строящийся склад", Истина)) 
	.Установить("ВидЦен", Справочники.ВидыЦен.Закупочная) 
	.Установить("Валюта", Справочники.Валюты.НайтиПоНаименованию("Рубли", Истина)) 
	.Установить("Организация", Справочники.Организации.НайтиПоНаименованию("ООО ""1000 мелочей""", Истина)) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  // Еще варианты: ВРаботе, Выполнен, Закрыт
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Admin", Истина)) 
	.Установить("Сумма", 2222) 
	.Установить("Онлайн", Истина)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Sony К3456P", Истина)) 
				.Установить("Цена", 50000) 
				.Установить("Количество", 1) 
				.Установить("Сумма", 50000)
	.Провести() // Проводим документ и возвращаем ссылку
	;

ОформлениеПродажи.ОформлениеПродажи();

МассивСсылок = Новый Массив;
МассивСсылок.Добавить(Ссылка1);
МассивСсылок.Добавить(Ссылка2);

Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходТовара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходТовара КАК РасходТовара
		|ГДЕ
		|	РасходТовара.Заказ В(&Заказы)";
	
	Запрос.УстановитьПараметр("Заказы",МассивСсылок);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().Количество();

	ЮТест.ОжидаетЧто(РезультатЗапроса).Равно(2)


КонецПроцедуры

